{
  "jobs": [
    {
      "id": "1",
      "title": "Senior React Developer",
      "type": "Full-Time",
      "location": "Boston, MA",
      "description": "We are seeking a talented Front-End Developer to join our team in Boston, MA. The ideal candidate will have strong skills in HTML, CSS, and JavaScript, with experience working with modern JavaScript frameworks such as React or Angular.",
      "salary": "$70K - $80K",
      "company": {
        "name": "NewTek Solutions",
        "description": "NewTek Solutions is a leading technology company specializing in web development and digital solutions. We pride ourselves on delivering high-quality products and services to our clients while fostering a collaborative and innovative work environment.",
        "contactEmail": "contact@teksolutions.com",
        "contactPhone": "555-555-5555"
      }
    },
    {
      "id": "5",
      "title": "Full Stack React Developer",
      "type": "Full-Time",
      "description": "Exciting opportunity for a Full-Time Front-End Developer in bustling Atlanta, GA. We are seeking a talented individual with a passion for building elegant and scalable web applications. Join our team and make an impact!",
      "location": "Atlanta, GA",
      "salary": "$90K - $100K",
      "company": {
        "name": "Browning Technologies",
        "description": "Browning Technologies is a rapidly growing technology company specializing in e-commerce solutions. We offer a dynamic and collaborative work environment where employees are encouraged to think creatively and innovate.",
        "contactEmail": "contact@consecteturadipisicing.com",
        "contactPhone": "555-555-5555"
      }
    },
    {
      "id": "6",
      "title": "React Native",
      "type": "Part-Time",
      "location": "Portland, OR",
      "description": "Join our team as a Front-End Developer in beautiful Portland, OR. We are looking for a skilled and enthusiastic individual to help us create innovative web solutions. Competitive salary and great benefits package available.",
      "salary": "$100K - $110K",
      "company": {
        "name": "Port Solutions INC",
        "description": "Port Solutions is a leading technology company specializing in software development and digital marketing. We are committed to providing our clients with cutting-edge solutions and our employees with a supportive and rewarding work environment.",
        "contactEmail": "contact@ipsumlorem.com",
        "contactPhone": "555-555-5555"
      }
    },
    {
      "id": "c283",
      "title": "React.Js Developer",
      "type": "Internship",
      "location": "Karachi",
      "description": "Are you passionate about front-end development and excited to work on real-world projects? CarpeDiem is looking for a driven and curious React Developer Intern to join our dynamic team. If you’re eager to sharpen your skills, build beautiful interfaces, and learn from experienced developers in a supportive environment, this internship is for you.",
      "salary": "Under $50K",
      "company": {
        "name": "Carpediem",
        "description": "At CarpeDiem, we believe in more than just delivering digital solutions—we believe in creating experiences that leave a lasting impact.\n\nFounded with the spirit of innovation and creativity, CarpeDiem is a full-service digital agency that partners with brands to design, build, and scale powerful online experiences. From elegant websites to robust eCommerce platforms, custom applications, and marketing strategies, we blend technology with design to help businesses grow in the digital age.",
        "contactEmail": "careers.carpediem@gmail.com",
        "contactPhone": "555-555-5555"
      }
    },
    {
      "id": "99a2",
      "title": "dsadwda",
      "type": "Remote",
      "location": "Boston, MA",
      "description": "dsfdszxcsc",
      "salary": "$60K - 70K",
      "company": {
        "name": "Dolor Cloud",
        "description": "sdewrwscsac",
        "contactEmail": "contact@teksolutions.com",
        "contactPhone": "+923322467774"
      }
    },
    {
      "id": "d42c",
      "title": "Senior Software Enginner",
      "type": "Part-Time",
      "location": "Miami, FL",
      "description": "Ensure that the job title you create is specific and aligns with the duties and responsibilities carried by the employee, and is generally recognized by ...",
      "salary": "Under $50K",
      "company": {
        "name": "NewTek Solutions",
        "description": "Ensure that the job title you create is specific and aligns with the duties and responsibilities carried by the employee, and is generally recognized by ...",
        "contactEmail": "mhussain8440@gmail.com",
        "contactPhone": "+923322467774"
      }
    },
    {
      "id": "ad0a",
      "title": "React Developer",
      "type": "Part-Time",
      "location": "Karachi",
      "description": ",jsakjaudgkjsadukadg",
      "salary": "Under $50K",
      "company": {
        "name": "Marten Digitals",
        "description": "sadwqdascsacascsacs",
        "contactEmail": "mh575390@gmail.com",
        "contactPhone": "03322468884"
      }
    }
  ]
}